In [18]:
import pandas as pd

In [19]:
data = {"Book title" : ["The ALchemist" ,"Forty rules of love","Sapiens" , "Atomic Habit"],
        "Author" : ["Paulo Coelho", "Elif Shafak" , "Yuval Noah Harari" , "James Clear"],
        "Price PKR" : [1200,1500,2200,1800],
        "Stock" : [15,25,10,30]}

In [20]:
df = pd.DataFrame(data)

In [21]:
df

            Book title             Author  Price PKR  Stock
0        The ALchemist       Paulo Coelho       1200     15
1  Forty rules of love        Elif Shafak       1500     25
2              Sapiens  Yuval Noah Harari       2200     10
3         Atomic Habit        James Clear       1800     30

In [22]:
genre = pd.Series(["Fiction" , "Romance" , "History" ,"Self-Help"])

In [23]:
genre

0      Fiction
1      Romance
2      History
3    Self-Help
dtype: object

In [24]:
df["Genre"] = genre

In [25]:
df

            Book title             Author  Price PKR  Stock      Genre
0        The ALchemist       Paulo Coelho       1200     15    Fiction
1  Forty rules of love        Elif Shafak       1500     25    Romance
2              Sapiens  Yuval Noah Harari       2200     10    History
3         Atomic Habit        James Clear       1800     30  Self-Help

In [26]:
df.drop(columns="Genre", inplace=True)

In [27]:
df.insert(2,"Genre",genre)

In [28]:
df

            Book title             Author      Genre  Price PKR  Stock
0        The ALchemist       Paulo Coelho    Fiction       1200     15
1  Forty rules of love        Elif Shafak    Romance       1500     25
2              Sapiens  Yuval Noah Harari    History       2200     10
3         Atomic Habit        James Clear  Self-Help       1800     30

In [29]:
bookData = df[df["Book title"] == "Sapiens"]

In [31]:
df["Book title"] == "Sapiens"

0    False
1    False
2     True
3    False
Name: Book title, dtype: bool

In [30]:
bookData

  Book title             Author    Genre  Price PKR  Stock
2    Sapiens  Yuval Noah Harari  History       2200     10

In [34]:
def checkStock(bookTitle):

    bookData = df[df["Book title"] == bookTitle]

    if not bookData.empty:
        stockCount = bookData["Stock"].iloc[0]
        print(f"Stock for {bookTitle} : {stockCount}")
    else:
        print(f"Book not found : {bookTitle}")

checkStock("Sapiens")
checkStock("The Hobbit")

Stock for Sapiens : 10
Book not found : The Hobbit

In [36]:
totalInventoryValue = (df['Price PKR'] * df["Stock"]).sum()
print(totalInventoryValue)

131500

In [37]:
reOrderCondition = df["Stock"] <= 15
reOrderList = df[reOrderCondition]["Book title"]
print(reOrderList)

0    The ALchemist
2          Sapiens
Name: Book title, dtype: object

In [38]:
author2 = df.loc[2,"Author"]
print(author2)

Yuval Noah Harari

In [39]:
row2 = df.loc[2]
print(row2)

Book title              Sapiens
Author        Yuval Noah Harari
Genre                   History
Price PKR                  2200
Stock                        10
Name: 2, dtype: object

In [41]:
subset = df.loc[[0,3],["Book title" , "Stock"]]
print(subset)

      Book title  Stock
0  The ALchemist     15
3   Atomic Habit     30

In [42]:
cell12 = df.iloc[1,4]
print(cell12)

25

In [43]:
firstRow = df.iloc[0]
print(firstRow)

Book title    The ALchemist
Author         Paulo Coelho
Genre               Fiction
Price PKR              1200
Stock                    15
Name: 0, dtype: object

In [44]:
subsetIloc = df.iloc[0:2 , 0:2]
print(subsetIloc)

            Book title        Author
0        The ALchemist  Paulo Coelho
1  Forty rules of love   Elif Shafak